// Написать программу, которая принимает на вход цифру обозначающую день недели и проверяет иявлется ли это день выходным 
int number =9;
if (number ==6 || number == 7)
{
Console.WriteLine("yes");
}

else 
Console.WriteLine("no");
