// Написать программу которая на вход принимает трехзначное число а на выходе показывает вторую цифру этого числа
int number =458;

Console.WriteLine(number%10);