// Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.[-4, -8, 8, 2] -> [4, 8, -8, -2]
int size = ReadInt("Введите размер массива: ");
int[] numbers = new int[size];

FillArrayRandomNumbers(numbers, -9, 9);
WriteArray(numbers);

for(int i = 0; i < numbers.Length; i++)
{
numbers[i] = -numbers[i];
}

WriteArray(numbers);


void FillArrayRandomNumbers(int[] array, int min, int max)
{
for(int i = 0; i < array.Length; i++)
{
array[i] = new Random().Next(min, max + 1);
}
}

void WriteArray(int[] array)
{
for(int i = 0; i < array.Length; i++)
{
Console.Write(array[i] + " ");
}
Console.WriteLine();
}

int ReadInt(string message)
{
Console.Write(message);
return Convert.ToInt32(Console.ReadLine());
}
