// Написать прогрвмму, которая на вход принимает число а выдает квадрат
int number = new Random().Next(0,10);
Console.WriteLine(number);
int sqr = number * number;
Console.Write(number + " ");
Console.WriteLine(sqr);
